---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
source: html/b624de01-76a5-5303-2c88-a906a50f05e7.htm
---
# AnalysisDisplayMarkersAndTextSettings Methods

Compares two colored surface settings objects.